[
    {
        "title": "Zynga ZDK",
        "description": "ZDK team is responsible for maintaining Zynga's entire mobile framework, which is used across all of its games. This team handles the creation, maintenance, and updates of the framework's packages, as well as managing the releases. Additionally, we provide methods to simplify the installation and usage of the framework, both inside and outside of Unity.",
        "link": "",
        "responsibilities": [
            "Designed and implemented a solution using reflection to keep a memory profiler package working after an update that made some classes internal.",
            "Added unit tests in memory profiler to verify data consistency.",
            "Worked with Zynga stakeholders to architect and implement new functionality to distribute Zynga's core game engine inside Unity, speeding up installation and usage by an average of 50%.",
            "Developed common NuGet library using NuGet.Protocol to distribute Zynga's core game engine.",
            "Developed a system utilizing Zynga's track API to conduct comprehensive analytics on the new distribution functionality.",
            "Implement, maintain and review reliable code using C#.",
            "Increased Code Coverage in 5% using UnitTest in Unity.",
            "Perform builds, tests, and other basic CI/CD tasks using Jenkins."
        ],
        "tools": [
            {"name": "Unity", "logo": "unity-icon.svg"},
            {"name": "C#", "logo": "c-sharp-icon.svg"},
            {"name": "Jenkins", "logo": "jenkins-icon.svg"},
            {"name": "Github", "logo": "github-icon.svg"}

        ],
        "gallery": [
            "zynga-icon.png"
        ]
    },
    {
        "title": "Globant VR",
        "description": "This project is an internal prototype developed at Globant, aimed at creating an immersive and interactive VR experience. Users can watch streaming content and interact with real-time elements within the broadcast. The experience also integrates personalized ads tailored to the user, allowing for dynamic interaction with the content and advertisements in a seamless virtual reality environment.",
        "link": "",
        "responsibilities": [
            "Designes and implemented a multiplayer VR experience in Unity.",
            "Integrated various libraries, including XR Toolkit, 3D WebView, Playfab for data handling, Photon as the multiplayer, and used WebSocket protocol to listen to events.",
            "Worked with 3D artist to import and animate assets and sync them over the network."
        ],
        "tools": [
            {"name": "Unity", "logo": "unity-icon.svg"},
            {"name": "C#", "logo": "c-sharp-icon.svg"},
            {"name": "Github", "logo": "github-icon.svg"},
            {"name": "Playfab", "logo": "playfab-icon.png"},
            {"name": "Photon", "logo": "photon-icon.jpg"}
        ],
        "gallery": [
            "globant-icon.jpg"
        ]
    },
    {
        "title": "Table & Taste",
        "description": "Table & Taste was a food-themed interactive mobile game developed by CrowdStar, part of Glu Mobile. The game blends culinary experiences with interactive gameplay, offering players the chance to engage with food-related content in unique ways. Players can explore various aspects of cooking, and food styling, while also discovering new dishes and trends.",
        "link": "",
        "responsibilities": [
            "Redesigned and implemented the game's rewards flow, including the skip animation, reducing the time between matches and giving the player more control on what to see during rewards.",
            "Improved the features review process by 20% using videos during development.",
            "Implemented new loading screens using information from EA’s content tool.",
            "Designed and implemented dynamic HUD widgets to show new and in-progress goals."
        ],
        "tools": [
            {"name": "Unity", "logo": "unity-icon.svg"},
            {"name": "C#", "logo": "c-sharp-icon.svg"},
            {"name": "Zeplin", "logo": "zeplin-icon.png"}
        ],
        "gallery": [
            "glu-icon.png"
        ]
    },
    {
        "title": "Hobo Fight",
        "description": "Hobo Fight is a fast-paced, local multiplayer game of the King of the Hill genre, where players battle for control of a house. Developed during the Game Jam 2019, the game features two unique maps, various power-ups, and a roster of different characters to choose from, allowing for strategic and chaotic gameplay. Players must outmaneuver and outfight their opponents to maintain dominance over the house. Hobo Fight earned recognition by participating in the Indie Prize Awards 2019 in Los Angeles.",
        "link": "https://gawss.itch.io/hobo-fight",
        "responsibilities": [
            "Implemented character movement and controls, ensuring smooth and responsive player interactions.",
            "Developed the 2D depth system, allowing characters to move across different layers in the game environment.",
            "Integrated game art assets and animations, ensuring fluid transitions between actions and visually appealing gameplay.",
            "Collaborated with the design and art teams to synchronize character animations with player inputs and game mechanics.",
            "Optimized game performance and responsiveness for local multiplayer gameplay, improving the overall player experience."
        ],
        "tools": [
            {"name": "Unity", "logo": "unity-icon.svg"},
            {"name": "C#", "logo": "c-sharp-icon.svg"}
        ],
        "gallery": [
            "hobbo-fight-icon.png",
            "Hobo.webp",
            "Hobo1.webp",
            "Hobo2.webp",
            "Hobo3.webp"
        ]
    },
    {
        "title": "Rival Stars Basketball",
        "description": "I participated in the porting of Rival Stars Basketball from C++ to Unity at Wizard Fun Factory. My role involved enhancing the gaming experience by implementing key systems that ensured smooth gameplay and rewarding user engagement.",
        "link": "https://pikpok.com/games/rivalstarsbasketball/",
        "responsibilities": [
            "Developed the save system to allow players to save and load their game progress seamlessly.",
            "Integrated tournaments and rewards systems, providing players with exciting challenges and incentives for progression.",
            "Collaborated with cross-functional teams to ensure a cohesive gaming experience."
        ],
        "tools": [
            {"name": "Unity", "logo": "unity-icon.svg"},
            {"name": "C#", "logo": "c-sharp-icon.svg"},
            {"name": "C++", "logo": "c-plus-plus-icon.svg"}
        ],
        "gallery": [
            "rivals-icon.png",
            "rival-stars.webp",
            "rival-stars1.webp",
            "rival-stars2.webp"
        ]
    },
    {
        "title": "Project 6",
        "description": "Taxis Vs Ubers is a local multiplayer game for Pc. It can play with keyboard or joysticks.#Challenge your friends to know who is the best driver, carry passengers, drive quickly and get a lot of money.#My role in this game was lead developer, I worked on all gameplays mechanics, carry passengers, money, crashes and time.",
        "link": "",
        "responsibilities": [],
        "tools": [
            {"name": "Unity", "logo": "unity-icon.svg"},
            {"name": "C#", "logo": "c-sharp-icon.svg"}
        ],
        "gallery": [
            "zynga-icon.png"
        ]
    }
]